#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-R49diQwFfGEFGxXo

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-0654ebbbd69258c54]
aws_instance.composer_internal: Refreshing state... [id=i-02cfe356a7283027d]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-842948316]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-740566457]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-25e8648c-bfa1-439d-983d-9e5fa89350a5]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-95920c52-258e-4c87-bebc-8282abc53f87]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.vmimport_ec2 must be replaced
-/+ resource "aws_iam_policy" "vmimport_ec2" {
      ~ arn    = "arn:aws:iam::933752197999:policy/vmimport_ec2_staging" -> (known after apply)
      ~ id     = "arn:aws:iam::933752197999:policy/vmimport_ec2_staging" -> (known after apply)
      ~ name   = "vmimport_ec2_staging" -> "vmimport_ec2" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.vmimport_s3 must be replaced
-/+ resource "aws_iam_policy" "vmimport_s3" {
      ~ arn    = "arn:aws:iam::933752197999:policy/vmimport_s3_staging" -> (known after apply)
      ~ id     = "arn:aws:iam::933752197999:policy/vmimport_s3_staging" -> (known after apply)
      ~ name   = "vmimport_s3_staging" -> "vmimport_s3" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.vmimport must be replaced
-/+ resource "aws_iam_role" "vmimport" {
      ~ arn                   = "arn:aws:iam::933752197999:role/vmimport_staging" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Condition = {
                            StringLike = {
                                sts:Externalid = "vmimport"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            Service = "vmie.amazonaws.com"
                        }
                        Sid       = "VMImportPolicyRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-12-04T20:46:54Z" -> (known after apply)
      ~ id                    = "vmimport_staging" -> (known after apply)
      ~ name                  = "vmimport_staging" -> "vmimport" # forces replacement
      ~ tags                  = {
          ~ "Name"         = "Image Builder vmimport role - staging" -> "Image Builder vmimport role"
            # (2 unchanged elements hidden)
        }
      ~ unique_id             = "AROA5SZ7X2NX4JEX7R6BP" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.vmimport_ec2 must be replaced
-/+ resource "aws_iam_role_policy_attachment" "vmimport_ec2" {
      ~ id         = "vmimport_staging-20201204204656576600000006" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::933752197999:policy/vmimport_ec2_staging" -> (known after apply) # forces replacement
      ~ role       = "vmimport_staging" -> "vmimport" # forces replacement
    }

  # aws_iam_role_policy_attachment.vmimport_s3 must be replaced
-/+ resource "aws_iam_role_policy_attachment" "vmimport_s3" {
      ~ id         = "vmimport_staging-20201204204656723700000009" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::933752197999:policy/vmimport_s3_staging" -> (known after apply) # forces replacement
      ~ role       = "vmimport_staging" -> "vmimport" # forces replacement
    }

  # aws_iam_user_policy_attachment.imagebuilder_vmimport must be replaced
-/+ resource "aws_iam_user_policy_attachment" "imagebuilder_vmimport" {
      ~ id         = "imagebuilder_worker_staging-20201204204656609900000007" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::933752197999:policy/vmimport_ec2_staging" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*